// 1. Оголосіть змінні str, num, flag и txt зі значеннями «Привіт», 123, true, «true».
// За допомогою typeof переконайтесь, що значення змінних належать типам: string, number и  boolean.
//
// let str = 'Hello';
// let num = 123;
// let flag = true;
// let txt = 'true';
// console.log(typeof str);
// console.log(typeof num);
// console.log(typeof flag);
// console.log(typeof txt);

// 2. Оголосіть змінні a1, a2, a3, a4, a5. За домогою 3х математичних оператцій отримайте числа:
//     34,
//         12,
//         66,
//         90,
//         87
// Старайтесь використовувати різні оператори.
//     Example: 88 = (16 / 2) * 11
//
// let a1;
// let a2;
// let a3;
// let a4;
// let a5;
// a1 = 4+15+15;
// a2 = (3+3)*2;
// a3 = (121+77)/3
// a4 = (37*4)-58;
// a5 = 166-35-44;
// console.log(a1)
// console.log(a2)
// console.log(a3)
// console.log(a4)
// console.log(a5)

// 3.  Створіть змінні a6, a7, a8, a9, a10. Запишіть в них результати виразів:
//     5 % 3,
//     3 % 5,
//     5 + '3',
//     '5' - 3,
//     75 + 'кг'
//
// let a6;
// let a7;
// let a8;
// let a9;
// let a10;
// a6 = 5%3;
// console.log(a6);
// a7 = 3%5;
// console.log(a7);
// a8 = 5+'3';
// console.log(a8);
// a9 = '5'-3;
// console.log(a9);
// a10 = 75+'кг';
// console.log(a10);

// 4. Напишіть код, який вираховує площу прямокутника висотою 23см. (змінна height) та шириною 10см (змінна width).
// Значееня площі зберігати в змінній s.
//
// let h = 23;
// let w = 10;
// let s = h *  w;
// console.log(s);

// 5.  Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
//     результат поместите в переменную v.
//
// let hC = 10;
// let dC = 4;
// let v = 3.14*hC*dC;
// console.log(v);

// 6. У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
// Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).
//
// let n = 3;
// let m = 4;
// let k = Math.sqrt(Math.pow(n, 2) + Math.pow(m,2));
// console.log(k)

// 8. Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби (каждой на новой строки спомощью \n).
//
// alert('Мошуренко Ярослав Васильович\n34\nIT');

// 9. Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
//     Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
//   Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
//     Вывести в документ содержимое переменной concatenation спомощью document.write
//
// let str1 = 'Хто';
// let str2 = 'ти';
// let str3 = 'такий?';
// let concat = str1+' '+ str2+' '+str3;
// document.write(concat);

// 10. Подумайте Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
//
//     let str = "20";
//     let a = 5;
//     document.write(str + a + "<br/>");
//     document.write(str - a + "<br/>");
//     document.write(str * "2" + "<br/>");
//     document.write(str / 2 + "<br/>");

// 13. С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел, а вывод результата при помощи метода alert
//
// let a = +prompt();
// let b = +prompt();
// let res = a +b;
// alert(res);

// 14. С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя, фамилию и возраст, а вам не обходимо вывести строку такого вида
// Доброго вечера Иван Иванов, мои поздравления что вам 32 , а вывод результата при помощи метода alert
//
// let name = prompt("Write your name");
// let lastname = prompt("Write your lastname");
// let age = prompt('Write your age');
// // alert('Привіт ' + name + ' '+ lastname + ', мої вітання, що тобі ' + age);
// const stringForRepr = `Привіт ${name} ${lastname}, мої вітання, що тобі ${age}`
// alert(stringForRepr);

// 3
// Все параметры получаем с клавиатуры!!!!(prompt , confirm)
// Создать переменную isRoadClear которая характеризирует наличие на дороге машин.
//     Улучшаем предыдущее задание.
//     Если светофор зеленый и машин нет - вывести "иди".
//     Если светофор зеленый и машины есть  - вывести подожди пока нарушители проедут".
// Если светофор желтый и машины есть - вывести "жди".
//     Если светофор желтый и машин нет - вывести "все рано жди".
//     Если светофор красный и машин нет- вывести "стой все рано".
//     Если светофор красный - и машины есть вывести "стой и жди".
//     Если светофор в аварийном режиме вывести "делай что хочешь"!
//
//
// let lighting = prompt("Введіть колір світлофора");
// let isRoadClear = confirm("На дорозі є машини?");
//
// if (lighting === "green" && isRoadClear === false) {
//     alert("Йди");
// } else if (lighting === "green" && isRoadClear === true) {
//     alert("Чекай поки порушники проїдуть");
// } else if (lighting === "yellow" && isRoadClear === true) {
//     alert("Чекай");
// } else if (lighting === "yellow" && isRoadClear === false) {
//     alert("Все рівно чекай");
// } else if (lighting === "red" && isRoadClear === true) {
//     alert("Стій");
// } else if (lighting === "red" && isRoadClear === false) {
//     alert("Стій і чекай");
// } else {
//     alert("Роби що хочеш");
// }


